# config/personality_profiles.py

SEARCH_WORDS = {
    "1": { #yuki23675786
        "picture": "cute dog bright sunlight",
        "hashtags": [
            "#犬好きさんと繋がりたい",
            "#犬好き",
            "#犬のいる暮らし",
            "#犬のいる生活",
            "#愛犬",
            "#犬との暮らし",
            "#犬好きと繋がりたい",
            "#犬好き集まれ",
            "#わんこ",
            "#いぬすたぐらむ",
        ]

    },
    "2": { #Ren47291
        "picture": "sexy japanese langery girl",
        "hashtags": [
            "#グラビア",
            "#水着女子",
            "#大人女子",
            "#ランジェリー",
            "#美女",
            "#大人の魅力",
            "#美しい女性",
            "#セクシー",
            "#モデル撮影",
            "#ビューティー",
        ]

    },
    "3": { #Sora36100
        "picture": "happy cat bright",
        "hashtags": [
            "#猫好きさんと繋がりたい",
            "#猫好き",
            "#猫のいる生活",
            "#猫のいる暮らし",
            "#ねこすたぐらむ",
            "#猫好き集まれ",
            "#にゃんこ",
            "#癒し猫",
            "#保護猫",
            "#猫は癒し",
        ]

    },
    "4": { #AdultSelectLab
        "picture": "experimental",
        "hashtags": [
            "#AIアート",
            "#ジェネレーティブアート",
            "#アート好きな人と繋がりたい",
            "#実験中",
            "#作品制作",
            "#創作活動",
            "#アートワーク",
            "#デジタルアート",
            "#未来の表現",
            "#アート好き",
        ]
    },
}
